Revit 2027 API
SizingOptions(SizingOptions) Constructor
 Constructs a new copy of the SizingOptions object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SizingOptions(
	SizingOptions other
)
Public Sub New (
	other As SizingOptions
)
public:
SizingOptions(
	SizingOptions^ other
)
new :
        other : SizingOptions -> SizingOptions
Parameters
other SizingOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SizingOptions Class
SizingOptions Overload
Autodesk.Revit.DB.Analysis Namespace